In [1]:
import pandas as pd
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [2]:
obj = obj.reindex(['a','b','c','d'])
obj

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [3]:
import numpy as np

frame = pd.DataFrame(np.arange(9).reshape(3,3),
                    index = ['a', 'c', 'd'],
                    columns = ['台北', '台中', '高雄'])
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [4]:
frame.reindex(index=['a','c'],columns=['台北','台中'])

   台北  台中
a   0   1
c   3   4

In [5]:
obj = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [6]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [7]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [8]:
obj.drop(['d','e'])

a    0.0
b    1.0
c    2.0
dtype: float64

In [9]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [10]:
#drop()
data.drop(['台北','台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [11]:
data.drop(['one','two'],axis=1)

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [12]:
data.drop(columns=['one','two'])

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [13]:
data.drop(index=['台北','台中'], columns=['one','two'])

    three  four
台南     10    11
高雄     14    15

In [14]:
data.drop(index=['台北','台中'], columns=['one','two'],inplace=True)

In [15]:
data

    three  four
台南     10    11
高雄     14    15